TestEDT/src/Documents/уа_ВводВыводЦенныхБумаг/уа_ВводВыводЦенныхБумаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уа_ВводВыводЦенныхБумаг</name>
  <registerRecords>AccountingRegister.ЕПС</registerRecords>
  <registerRecords>AccumulationRegister.уа_РасчетыПоЦеннымБумагам</registerRecords>
  <registerRecords>InformationRegister.уа_ПараметрыРасчетаАмортизации</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.уа_ВидыОперацийВводВыводАктивовИзДУ</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Активы</name>
    <attributes>
      <name>ДатаПартии</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.уа_ФинансовыеИнструменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПриобретения</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАмортизации</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаНакопленногоДисконта</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияАмортизации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизации</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизацииВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ПогашеннаяАмортизацияДисконта</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>УКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>УКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминала</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминалаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКупонаКПолучению</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКупонаКПолучениюВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерва</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНоминалаКПолучению</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНоминалаКПолучениюВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭСП</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЕПС</name>
      <type>
        <types>ChartOfAccountsRef.ЕПС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT/src/InformationRegisters/уа_СоответствияОбъектовУчета/уа_СоответствияОбъектовУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_СоответствияОбъектовУчета</name>
  <resources>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.уа_ВидыОбъектовИмпорта</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.уа_Идентификатор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаИмпорта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.уа_ВидыОбъектовИмпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.уа_ИсточникиДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/Documents/уа_ВводВыводЦенныхБумаг/Forms/ФормаЗагрузки/Module.bsl
// СОБЫТИЯ ФОРМЫ
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет			= Документы.уа_ВводВыводЦенныхБумаг.ПолучитьМакет("МакетЗагрузки");
	ОбластьЗаголовка= Макет.ПолучитьОбласть("Заголовок");
	ЭтотОбъект.тдЗагрузка.Вывести(ОбластьЗаголовка);
КонецПроцедуры

#КонецОбласти

// КОМАНДЫ ФОРМЫ
#Область КОМАНДЫ_ФОРМЫ

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ВладелецФормы.Объект.Активы.Количество() > 0 Тогда 		
		Оповещение = Новый ОписаниеОповещения("ВыборПользователяПоЗавершении",ЭтотОбъект); 		
		ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Заполнить?",
			РежимДиалогаВопрос.ДаНет); 		
	Иначе  		
		ЗагрузитьАктивы();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПользователяПоЗавершении(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВладелецФормы.Объект.Активы.Очистить();
		ЗагрузитьАктивы();
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАктивы()
	
	Состояние("Загрузка данных",,,БиблиотекаКартинок.ДлительнаяОперация48);
	ДокСсылка = ВладелецФормы.Объект;
	Данные = ЗагрузитьДанныеИзТабличногоДокумента(НачалоДня(ДокСсылка.Дата));
	Для каждого Элемент Из Данные Цикл
		Строка = ДокСсылка.Активы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Элемент);		
	КонецЦикла; 
	Состояние("Выполнена загрузка данных",,,БиблиотекаКартинок.ДлительнаяОперация48);
	ЭтаФорма.Закрыть();
		
КонецПроцедуры 

#КонецОбласти

// Служебные функции
#Область СлужебныеФункции

&НаСервере
Функция ПолучитьСоответствиеСтолбцовТабличногоДокумента()
	СоответствиеСтолбцов = Новый Соответствие;
	
	Макет			= Документы.уа_ВводВыводЦенныхБумаг.ПолучитьМакет("МакетЗагрузки");
	ОбластьСтруктуры= Макет.ПолучитьОбласть("СтруктураТЧ");
	КолвоСтолбцов 	= ОбластьСтруктуры.ШиринаТаблицы;

	Для НомерСтолбца = 1 По КолвоСтолбцов Цикл
		Область = ОбластьСтруктуры.Область(1, НомерСтолбца, 1, НомерСтолбца);
		СоответствиеСтолбцов.Вставить(НомерСтолбца, Область.Текст);
	КонецЦикла;
	
	Возврат СоответствиеСтолбцов;
КонецФункции


&НаСервере
Функция ЗагрузитьДанныеИзТабличногоДокумента(Дата)
	ТаблДок = ЭтотОбъект.тдЗагрузка;
	
	КолвоСтрок 		=  ТаблДок.ВысотаТаблицы;
	КолвоСтолбцов 	=  ТаблДок.ШиринаТаблицы;
	
	СтруктураСтолбцов = ПолучитьСоответствиеСтолбцовТабличногоДокумента();
	
	ТЗ = Документы.уа_ВводВыводЦенныхБумаг.ПустаяСсылка().Активы.ВыгрузитьКолонки();
	ТипИдентификатор= Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.уа_Идентификатор.Тип);
	ТЗ.Колонки.Добавить("Идентификатор", ТипИдентификатор);  
	
	СписокАктивов = Новый Соответствие;
		
	Для НомерСтроки = 2 По КолвоСтрок Цикл  
		Строка = ТЗ.Добавить();
		Для НомерСтолбца = 1 По КолвоСтолбцов Цикл
			ОбластьТД  = ТаблДок.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца);
			
			Попытка
				Если ТипЗнч(Строка[СтруктураСтолбцов[НомерСтолбца]]) = Тип("Дата") Тогда
					Строка[СтруктураСтолбцов[НомерСтолбца]] = СокрЛП(ОбластьТД.Текст) + " 00:00:00";
				Иначе
					Строка[СтруктураСтолбцов[НомерСтолбца]] = СокрЛП(ОбластьТД.Текст);
				КонецЕсли;	
			Исключение
				
			КонецПопытки;    			
		КонецЦикла; 
		
		Если СписокАктивов.Получить(Строка.Идентификатор) = Неопределено Тогда
			СписокАктивов.Вставить(Строка.Идентификатор);	
		КонецЕсли;     		
	КонецЦикла;
	
	уа_ОбменСRUDATA.ЗаполнитьЦенныеБумаги(СписокАктивов);
	
	Возврат ПолучитьМассивЗначений(ТЗ, Дата);
КонецФункции


&НаСервере
Функция ПолучитьМассивЗначений(ТЗ, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ДатаПартии, НомерПартии, Идентификатор, Количество, 
	|	ЦенаПриобретения, ЦенаАмортизации, ЦенаНакопленногоДисконта, ДатаОкончанияАмортизации,
	|	СуммаВал, СуммаАмортизацииВал, НКДВал, УКДВал, СуммаИндексацииНоминалаВал, СуммаПереоценкиВал, СуммаКорректировкиВал, СуммаРезерваВал,
	|	ЭСП, СуммаНУ
	|ПОМЕСТИТЬ ТЗ_Активы
	|ИЗ &ТЗ КАК Т;
	|
	|ВЫБРАТЬ 
	|	А.ДатаПартии, 
	|	А.НомерПартии, 
	|	А.Количество, 
	|	А.ЦенаПриобретения, 
	|	А.ЦенаАмортизации, 
	|	А.ЦенаНакопленногоДисконта, 
	|	А.ДатаОкончанияАмортизации,
	|	А.СуммаВал, 
	|	А.СуммаАмортизацииВал, 
	|	А.НКДВал, 
	|	А.УКДВал, 
	|	А.СуммаИндексацииНоминалаВал, 
	|	А.СуммаПереоценкиВал,
	|	А.СуммаКорректировкиВал,
	|	А.СуммаРезерваВал,
	|	А.ЭСП, 
	|	А.СуммаНУ,
	|	ФИ.Ссылка КАК ЦеннаяБумага,
	|	ФИ.ВалютаНоминала КАК Валюта,
	|	ЕСТЬNULL(КВ.Курс,1) КАК КурсДокумента,
	|	ЕСТЬNULL(КВ.Кратность,1) КАК КратностьДокумента
	|ИЗ ТЗ_Активы КАК А
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уа_СоответствияОбъектовУчета КАК СОУ ПО СОУ.Идентификатор = А.Идентификатор 
	|		И СОУ.ВидОбъектаИмпорта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.уа_ВидыОбъектовИмпорта.ФинансовыеИнструменты)
	|		И СОУ.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.уа_ИсточникиДанных.RuData)
	|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уа_ФинансовыеИнструменты ФИ ПО ФИ.Ссылка = СОУ.ОбъектУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата) КВ ПО КВ.Валюта = ФИ.ВалютаНоминала
	|УПОРЯДОЧИТЬ ПО ЦеннаяБумага, ДатаПартии, НомерПартии АВТОУПОРЯДОЧИВАНИЕ;";	
		
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Массив = Новый Массив;

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Массив;		
	КонецЕсли; 
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();    
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура(
			"ДатаПартии, НомерПартии, Количество, ЦенаПриобретения, 
			|ЦенаАмортизации, ЦенаНакопленногоДисконта, ДатаОкончанияАмортизации, 
			|Сумма, СуммаАмортизации, НКД, УКД, СуммаИндексацииНоминала, СуммаПереоценки, СуммаКорректировки, СуммаРезерва, 
			|СуммаВал, СуммаАмортизацииВал, НКДВал, УКДВал, СуммаИндексацииНоминалаВал, СуммаПереоценкиВал, СуммаКорректировкиВал, СуммаРезерваВал, 
			|ЭСП, СуммаНУ, ЦеннаяБумага, Валюта, КурсДокумента, КратностьДокумента"
		);
		ЗаполнитьЗначенияСвойств(Структура, Выборка);	
		
		Курс		 							= Структура.КурсДокумента / Структура.КратностьДокумента;
		Структура.Сумма							= Окр(Структура.СуммаВал * Курс, 2 );
		Структура.СуммаАмортизации 				= Окр(Структура.СуммаАмортизацииВал * Курс, 2 );
		Структура.НКД 							= Окр(Структура.НКДВал * Курс, 2 );
		Структура.УКД							= Окр(Структура.УКДВал * Курс, 2 );
		Структура.СуммаИндексацииНоминала 		= Окр(Структура.СуммаИндексацииНоминалаВал * Курс, 2 );
		Структура.СуммаПереоценки 				= Окр(Структура.СуммаПереоценкиВал * Курс, 2 );
		Структура.СуммаКорректировки		 	= Окр(Структура.СуммаКорректировкиВал * Курс, 2 );
		Структура.СуммаРезерва					= Окр(Структура.СуммаРезерваВал * Курс, 2 );
		
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
КонецФункции;

#КонецОбласти
